case/outputs_mitigated/openfoam_cases/section_3_x30p9km/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.00916945;

boundaryField
{
    inlet   { type fixedValue; value uniform 0.00916945; }
    outlet  { type inletOutlet; inletValue uniform 0.00916945; value uniform 0.00916945; }
    walls   { type kqRWallFunction; value uniform 0.00916945; }
}
