case/outputs_mitigated/openfoam_cases/section_3_x30p9km/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 -1 0 0 0 0];
internalField uniform 9.81353;

boundaryField
{
    inlet   { type fixedValue; value uniform 9.81353; }
    outlet  { type inletOutlet; inletValue uniform 9.81353; value uniform 9.81353; }
    walls   { type omegaWallFunction; value uniform 9.81353; }
}
