case/outputs_mitigated/openfoam_cases/section_3_x30p9km/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1
if [ -n "$WM_PROJECT_DIR" ] && [ -f "$WM_PROJECT_DIR/bin/tools/RunFunctions" ]; then
    . "$WM_PROJECT_DIR/bin/tools/RunFunctions"
fi
if [ -d 0.orig ]; then rm -rf 0 && cp -r 0.orig 0; else cp -r 0 0.orig; fi
run() { "$1" > "log.$1" 2>&1 || { echo "FAILED: $1 (see log.$1)" >&2; exit 1; }; }
run blockMesh
run setFields
run interFoam
echo done
